/**
 * 
 */
package com.tencent.tmsecure.demo.intelli_sms;

import tmsdk.common.SmsEntity;
import tmsdk.common.module.intelli_sms.IntelliSmsCheckResult;
import tmsdk.common.module.intelli_sms.IntelliSmsManager;
import android.util.Log;

/**
 * @author jiangweiti
 *
 */
public class SmsCheckTest {
	
	private static final String[] ARRAY_SMS = {
			"1", "10690133051611", "【e栈】摇好礼赢手机！快递*4521（邮政）投递于御海新苑单车棚e客栈，取件码277794，4008306600【 中集电商 】",
			"2", "10690133051611", "欢迎使用网易邮箱服务，您的验证码是620953。用网易邮箱APP，享免费随身邮件提醒。点击下载 u.163.com/app38【网易】",
			"3", "10690133051611", "【 深圳都市报 】 通知深圳都市报中小学征文活 动，请您和孩子明天（周六）上午10点30准时到福田商报大厦2楼参加作品指导和证书颁发电话33050269",
			"4", "12520693318038", "您好！您已成功订购中国移动无线TV业务，标准资费118元/月。如需退订请编辑短信“HK0D0011550629116”到10086。 中国移动",
			"5", "1069029816090", "【好递】您好，一六圆通，您有快递，地址：步步服装超市对面，电话：3966366.上班时间：9:00-6:00 短信可回复，屏蔽短信回1",
			"6", "95599", "【中国农业银行】验证码：411933，请勿泄露,尊敬的客户，您正在支付末位2229的订单，金额145.00元",
			"7", "10001", "您可办理一次性付费优惠包：办理后立即生效（不抵消订购前已使用的上网流量），仅本月有效，次月自动失效，请回代码：8613 办一次性包20元150M 8612 办一次性包10元60M 861 查询更多一次性包 862 查询更多包月包 863 查询特惠夜间包 83 短彩信优惠包 800 拒收此类短信 本提醒短信仅供参考，请以实际查询结果为准",
			"8", "10690210100926442", "尊敬的用户，您好，我是ZUK工作人员，针对您反馈要求补发20元优惠券问题，我们尝试联系您，但未联系上，现已将20元优惠券补发至您的账户，请及时查收。感谢您对ZUK的支持，如有疑问欢迎您拨打热线：400-8828-228，以获取更多资讯及帮助。回TD退订【ZUK】【联想】"
//		"1", "13990379659", "神驹踏上平安道，天上人间皆欢笑。爆竹声里热情高，合家团圆乐淘陶。招财进宝福星照，万事如意生活好。只愿马年无烦恼，幸福快乐将你抱。张红祝你春节快乐",
//		"2", "13990379659", "老大，给你拜个早年！祝你201 4说神马就是神马。红包什么的，别给太多，意思下就行了哈。http://m.alipay.com/J/iJ86Y9Mg",
//		"3", "10690133051611", "3月6日10点您预约的Xplay3S全网首发，首批购买可享购机基金及惊喜，您的预定码是TDTB123987【vivo】",
//		"4", "10690133051611","陈兴强这是之前的聚会照弄好了，大家的精彩瞬间。手机直接点击地址x安装激活查看is.gd/baidu2c",
//		"5", "10655020051381600", "购地中海永久产权别.墅，2个月全家速获欧盟绿.卡，子女享英式教育。本周六14点半中国大饭店多功能2厅15911181248谢娜【世贸通】",
//		"6", "1065795555", "[分期购车0负担]6月底前至招行一汽大众北京合作4S店分期购速腾、迈腾、CC、捷达指定款享18期0费率！询84271357/67[招商银行]",
//		"7", "106575259441730", "18万起一线海景精装现房！六一带孩子来海边撒欢吧，多米诺赢奖、魔法气球、赏地中海美景！购房有机会再得1套房，山海同湾4001185666",
//		"8", "951317455519429", "【迈途户外】京东品牌团，支持货到付款，春夏新款全场低至二折，领券满500减50！活动时间仅一天：4.17-4.18 09：30",
//		"9", "106575259484902000", "特价：现房首付15万，77平-144平，精典房型,，高绿化率。赠露台、花厅，班车一站到地 铁！抢到即赚4006909406",
//		"10","000001008611","一木疯狂大减价，“钜惠广饶“青岛一木六十年的经典品牌，价格低的不能再低，您还在犹豫什么？赶快行动吧。广饶义务二楼。6669111",
//		"11","02752711747","尊敬的业主：蓝滨1号小区于5月31日下午14：30-16：30举行“欢乐庆六一、健康过端午”包粽子活动，欢迎您的叁与！[绿港物业]",
//		"12","053288079000","5月31日下午4点由海亮金宝街冠名赞助的第四届中国钢管舞锦标赛内蒙赛区拉开帷幕，届时海亮金宝街端午期间惊喜不断~快来金宝街享受假期之旅吧！",
//		"13","100000395","油价又涨了！买车容易养车难，拿它真没辙！谁说“没折”？悄悄告诉你：用中国电信天翼加油卡在中石油加油每升立省3毛，在中石化加油每升立省2毛5！（限93、97号汽油），你只需到电信营业厅办理天翼加油卡即可让您开心享受加油优惠，详询10000或关注漯河电信易信、微信公众账号",
//		"14","10001", "中国电信温馨提示:您的套餐内还有免费的上网流量，使用您本月剩余流量可参与流量大转盘抽大奖，发送888到10008，或点击http://hb189.mobi/lldzp 宋远红 18908603320",
//		"15","10001", "尊敬的用户，您好！您本月套餐包含:天翼-飞Young纯流量云卡（预付费）-19元/300M:手机流量300MB已用300MB,促销流量卡:手机流量900MB已用891.24MB,详询10000。您可以发送4112到10001订购5元/30M一次性流量加餐包，发送4113到10001订购10元/60M一次性流量加餐包。",
//		"16","10001", "[湖北电信]电信销售经理黎俊向您推荐“天翼客服”?,?电信天翼手机服务门户，实时掌握流量、话费、积分，活动天天有、奖品送不停，是您的贴身服务小管家!安卓下载地址为?http://hb189.mobi/wom4j??苹果下载地址?http://hb189.mobi/q81j7",
//		"17","1001010", "今年的光棍节你有份吗？光棍节必须要Happy!无论你是一个人、两个人、或是一群人，无论你是恶搞或是晒幸福，分享照片@湖南联通的官方微博就有机会赢流量、得话费，更有手机大奖哦！没错！就是这样！没有比这个更简单的了。小伙伴们再也不用担心过光棍节了，快快快，动起来！",
//		"18","100108866"," 2014世界杯红包终于来啦!即日起至6月30日抢订8G超大省内流量包，只需20元，手机看直播，一场也不落!70多套直播频道，体育、综艺、海内外热门大片等丰富影视剧资源任您点播。短信回复511开通，详情点击：http://www.js165.com/businessdetail.html?busid=195&tag=type。如不需此项信息服务可回复0000退订。",
//		"19","10010"," 尊敬的联通用户，您的流量优惠如下：3G国内流量包-30元套餐,优惠:500.0M,已用:139.41M,剩余:360.59M。3G基本套餐B-96元（全月）,优惠:80.0M,已用:80.0M,剩余:0.0M。感谢您的使用。 【3G流量包，网速快资费优，回复503选择订购】",
//		"20","10010"," 流量短信提醒默认按周发送，您将在每周一和每月第一天收到短信提醒。您可直接回复ATTX更改为按天提醒，或回复QXTX取消短信提醒功能。下载中国联通【手机营业厅】轻松查话费、查流量、查详单，充值享9.85折，在线客服快速答疑，点击 wap.10010.com 。",
//		"21","10018888"," 手机上网流量轻松掌控！江苏联通推荐您使用流量管家业务，每月仅需1元，定期为您提供当月使用流量情况提醒服务！回复401开通。或请点击： http://go.js165.com/i/1/klq8lhHM",
//		"22","1008600092205"," 尊敬的客户：您好！上一道题的答案是B，下一道题目是：发送短信代码“SJYYT”或“手机营业厅”到10086，可以收到手机营业厅客户端下载地址，链接下载后即可使用？（）A.可以B.不可以",
//		"23","10086055500002"," 移动缴费卡大派送啦！即日起办理移动4M光宽带包两年900元赠送300元缴费卡，不捆绑，老客户续费还可加赠一个月，各移动网点及现场活动均可受理。更多优惠咨询13605655324！",
//		"24","100860790"," 4G乡乡通，人人用得起!新余移动199元购真4G手机，仅需再预存500元话费，还送6000M流量，欢迎您到各移动营业厅抢鲜品鉴!用移动",
//		"25","10086119"," 回复对应序号了解活动详情： 1、世界杯纪念版流量充值卡限量抢 2、新版10/20闲时流量套餐 3、移动合家欢1元升级，省内畅享 4、网上营业厅，交费享9.85折 5、动感网龄金币校园存送活动 6、神州行长话卡-贺岁卡（2014版）转资费存送活动 7、新入网送费活动",
//		"26","100862533"," 尊敬的淄博移动客户，为了给您提供更安全、更快捷的通信服务，根据国家统一部署，淄博移动全面进行网络升级，旧版手机卡将逐步淘汰，请广大移动客户至淄博各移动营业厅免费更换新版手机卡，新版手机卡容量更大、安全性更高，现在办理还赠送800MB流量。详询各移动营业厅。",
//		"27","1008641021815926"," 12580和你做作业，学习好帮手！会员通过语音和彩信就能享受一对一中小学课业辅导，每月10元，方便有效！回复任意短信即可订制并送10元和包，询12580",
//		"28","10086885"," 刚10088电话联系您告知最新的移动存送活动，您未接听到，如需了解，可直接回复短信或拨打10088热线咨询。",
//		"43","10622556688"," 别犹豫啦！首钢华生惊天夜卖！6月21-22日下午2点-8点全场0利！剃须刀19三门冰箱1399电视最高直降2000！凭函入场67050555",
//		"44","10629500"," 您的准考证号为141521300106，确认请回复1231，修改请回复123+准考证号，2元/条",
//		"45","10651878980"," 渤海大学成教，高中升大专，专升本，正在招生中，工商管理，市场营销，财务管理，人力资源等专业正在报名中QQ516416669电话3992576",
//		"46","106550101908223485"," 美团会员：《变形金刚4》6月27日震撼上映，猫眼用户专享，提前抢票选帝王座，点击抢票 http://t.cn/RvWUg1s【猫眼电影】",
//		"47","1065501055952035575"," 通知：今日指导介入600665.请留意.明日将拉高出货.回复T退订.如有疑问请致电：0752－8465337【广发】",
//		"48","1065502701035943"," 寒冷的初冬悄然而至，She“s双11带来爱的温暖：全年最低,5折封顶.记得提前加入购物车和领券哦：shes.tmall.com【茜子】",
//		"49","106550771052090501"," 5月31日诚邀初三学生及家长来校体验北理工国际高中Alevel课程说明及公开课电话07563622789回复TD退订【北理工珠海学院】",
//		"50","1065507730123556082"," 昌黎站前万佳家具广场【欧尔雅家私】26-30日千款家具低价出击：沙发1100元起，衣柜780元，茶几260元；部分样品狂甩，抢!【欧尔雅】",
//		"51","106554451011006607"," 联通流量送不停！指定套餐用户预存50元话费，共得1000M流量（7、8月为全国流量）。详情关注“哈尔滨沃派”微信账号按推送信息要求参与即赠。【吴雪,18603653662】",
//		"52","1065572147"," 新疆惊现1200万元\"天价羊\"http://g.wo.com.cn/14zno/67cFBk&h=1&f=a1039",
//		"53","10655791008003"," 吉林联通沃视吉林网站升级后开始公测更快更顺畅，登录http://122.141.250.116/jlvod 吉林省内免流量费观看电影电视剧享卫视直播盛宴，您还等什么！安卓用户看非直播节目建议用快播软件,不用下载直接观看。",
//		"54","106558700"," 【沃提醒】浙江联通给您推荐省钱好方法，订购3G国内流量包，回复901开通10元100M，902开通20元300M，903开通30元500M，订购次月生效！关注沃浙江官方微信，50G流量红包等您来领！更多详情请致电10010或点以下链接（如无需此提醒，请回复109688） http://hao.zj165.com/i/1/S9zgYPAL",
//		"55","1065595333333"," 7月手机上网看大片，有了“20元包4个G”省内流量包，妈妈再也不用担心我的流量了！本月最后抢购机会，点击 http://17186.cn 。搞笑配音，假如这些游戏都拍成电视剧《游戏奇谭》 http://i.533.net/YnABBz （7分39秒）",
//		"56","106566887788"," 盘锦都市医院（医保新农合定点）汇聚名医，引进美国内窥镜，德国等离子等国际尖端设备，一次性微创手术治疗鼻炎、咽喉炎、鼻息肉等电话6623888",
//		"57","10657006092850"," 客户经理温馨提醒您及时参加存话费送礼品活动，先到先得，各种礼品任您选择，详询营业厅或客户经理。【市区移动】",
//		"58","1065702148430"," 【捷乐自动门】肖老板，捷乐10平方以内的自动感应门5000元就可以全部搞掂并质保两年。咨询电话:88899910或13302597063",
//		"59","10657079152075"," 【滦县法信通】网购特价商品且已付款，在商家缺货时放弃退款选择等待，日后被告知优惠期已过需加钱。按照法律：消费者可要求商家继续履行原发货义务。",
//		"60","106571014977777"," 【7天连锁】7天酒店:北京市石景山区古城西街5号 010-68876667,保留到07月19日20点.用APP订房即获加倍积分激赏,8品牌通用,点击下载http://www.plateno.com/app",
//		"61","10657120011111"," 特色猪肚煲鸡、云南野生菌火锅，蓝亭韵食府恭候光临，地址：乐平锦溢华庭农行楼上，订座87333633[蓝亭韵茶餐厅]",
//		"62","1065712063000686"," 【东北证券】本周股指向上概率较高，但出现大幅飙升的可能性不大，建议投资者延续七成仓位。关注家用电器概念以及半年报业绩超预期的个股。财富管理部退订回复0",
//		"63","10657130879770100"," 6.1至7.1免保底免包厢费.青岛银标啤酒2箱400元送热菜两份,果盘1份。锦泰KTV85689125银都KTV85699068【银都娱乐】",
//		"64","106571611945790000"," 今晚7时半，在文化馆一楼（从大司巷小学大门口对面进）活动室进行季赛沙龙活动。内容有：1、国内外获奖作品幻灯片演示；2、上意艺术总监讲座；3、主题“冬”季赛和评选颁奖；主题为“冬”，2兆以上电子稿，可带到现场投稿，4、收取下周赴开化摄影创作的费用，会员每人200元，临时变动不再退回（非会员600元，多退少补）；5、创建摄影图书馆献书会员预登记。现场还有免费保养、清洗相机镜头和CCD活动。欢迎会员参加！[永康市艺术摄影学会]",
//		"65","106573026002"," 【沃华房地产】沃华中环广场儿童节献礼，5月31日至6月2日每天16时30分举行亲子嘉年华活动，刺激好玩的游戏等你来闯关拿礼品！5555818",
//		"66","1065730732011000"," 移动好活动又来了！手机摇一摇，百万话费、流量、三星智能机等你拿！点击<http://wap.0573g3.com/yyy>参与【嘉兴移动】",
//		"67","1065731151776110"," 渝乡辣婆婆为您卡内赠30元×3张共90元券，4.28-5.31到店消费菜品满百用1张当餐最高用2张询89180055【渝乡辣婆婆】",
//		"68","1065737322"," 法狮龙吊顶，厨卫吊顶十大品牌，一厨一卫特价套餐3980，特价板158，金水康桥北门门市，0417-3219677",
//		"69","106575011600"," 【太平洋保险】面试喜讯：祝贺丁跃文经理面试1人参训1人，韩海霞面试1人参训1人！截至目前各部面试情况如下：马效玲部面试14人，马效飞部面试12人，王金香部面试9人，韩静部、丁跃文部各面试5人，刘树春部面试4人，郭新玲部面试3人，田长安部、寿光直辖部各面试2人！暂时落后的部门请注意，抓住机会赶紧行动，确保7月22日参训！加油！",
//		"70","10657516190800596"," 春暖开’惠’啦！3月16日开春团购’惠’，全车系大幅给利，到店就知惊喜无穷，凡推荐成功获最高2000元售后代金券！3211182【科园日产】",
//		"71","10657521904267"," 【同程旅游】走，去无锡海底世界，穿行“海底隧道”，观赏“人鲨共舞”！点击 http://t.cn/RvCNKY9 订票仅30元，回复TD退订",
//		"72","1065752581911155"," 【阿里巴巴】阿里巴巴手机客户端下载地址：http://m.1688.com/a/GFHf 更多精彩请下载安装体验！",
//		"73","106575323088"," 【易方达高端消费品基金5月29日暂停申赎】尊敬的方朝阳，您好！鉴于境外主要交易所休市，易基高端消费品将于5月29日暂停申购、赎回等业务，5月30日起恢复，详见公告或询4008818016【易方达】",
//		"74","10657536013651156547"," 求购南国桃园会籍，转让君兰全日单身及家庭，九龙湖全日单身及平日，南湖家庭，莲花山家庭，18026279100李小姐【金杆子】",
//		"75","106575550249"," 【捷信公司】尊敬的田瑞良， 您的现金贷服务仍然有效。您可获3000-10000元现金满足消费需求。恭候您光临捷信柜台办理！贵宾专线4006381070。如您不希望收到此短信请回复99990080",
//		"76","10657555266788696"," 【淘宝】淘健康：【聚划算】蒂芬妮代餐奶昔99元！买3送1前30名付款免单 代餐饱腹无压力想瘦就猛戳http://url.cn/REvu8O",
//		"77","106575555208"," 【500彩票网】您注册的手机验证码：325947，请勿将验证码告知他人。",
//		"78","106575580895558"," 【中信信用卡】尊敬的曹震毅，根据您的用卡情况，特为您提供圆梦金专享分期额度52000元，致电激活即可随刷随分，详询4006995558",
//		"79","10657559956666"," 【CTRIP】您预订的7月17日K7119次哈尔滨-鹤岗硬座1张购票成功，开车时间13:52，取票号E431798643，路瑞博07车厢022号，开车前凭购票的有效证件原件到火车站取票（二代身份证可以在代售点取票），点击 http://a.tieyou.com 下载手机客户端随时随地订票",
//		"80","10657924365"," 【平安银行】您尾号1205信用卡将于8月底到期，新卡下月初寄送。为提供更专业服务，新卡将升级卡面和权益（首刷改赠交通意外险，金卡主卡再赠燃气险。原航意险和家财险随卡片到期失效），详询网站。如需更改账单地址请于本月25日前致电客服",
//		"81","1065798000"," 个股跟踪服务：本周一推荐的300205天喻信息，获利已超过5%，建议卖出了结。仅供参考。【中银国际】",
//		"82","1065802526"," 感谢使用中国移动问路服务，百万红包伴出行，点击链接100%中奖：http://221.180.144.85:18080/biwap/redPackage.action?p=83dcm78mx653af97659kp3439p75baff",
//		"83","10658126413125439573"," 13125439573通过和彩云给您分享文件，赶快来查看吧:http://caiyun.feixin.10086.cn/dl/0C16yNctZo3T ,【中国移动和彩云】",
//		"84","1065813914176936052"," 恭喜您获得由中国移动139邮箱赠送的短彩礼包；仅限本月登录邮箱使用！点击以下链接使用：发短信：　http://y.10086.cn/p?aid=sms发彩信：　http://y.10086.cn/p?aid=mms（温馨提醒：向联通、电信用户发短信与本地资费相同，不计入赠送条数）　[结束,回复本短信即回复邮件]",
//		"85","1065813917797561001"," 构筑绿色地球，共享低碳生活。客户名称：张俊霞手机号码：18365877111当前品牌：神州行计费周期：2014年04月08日至2014年05月07日——————————本期末余额现金余额39.64可用积分0本期费用合计69.05——————————【费用信息】>套餐及固定费用18.00>套餐外费用语音通信费42.35短彩信费0.70>增值业务费8.00>本月费用合计69.05——————————【账户信息】上月末结余+本期充值+使用协议款+退费+过户转入=本月合计可用8.69+100.00+0.00+0.00+0.00=108.69本月合计可用-本月费用合计-代他人[回复A读下文,回复本短信即回复邮件]",
//		"86","106581396617"," “和你一起 礼遇春天”恭喜您，参与活动，抽中幸运甜品电子券！奖品将发送到您的手机，请您注意查收，详询10086。",
//		"87","10658211"," 热爱足球？爱看世界杯？怎能错过足球游戏？下游戏，得点券，还有机会参加抽奖喔~详情 http://g.10086.cn/a/s/cupworld",
//		"88","10658306"," 唐山移动双节短信送祝福啦！回0免费品鉴乐信业务（0元/月）每周送您精彩短信，中秋、国庆短信源更不用愁，月转1条以上次月继续送！询10086",
//		"89","10658388"," 天气降温，购彩热情不降温！13127期大乐透喜开3注698万头奖，开奖号：03141619320510，前区中号区走热，后区开出一小一大奇偶组合，现奖池达1.65亿！马上回5机选五注大乐透（10元）回1机选一注大乐透（2元）揽获幸运大奖！",
//		"90","10658568891"," 小儿尿床，成人尿失禁，老年人尿频尿急；采用独特\"中枢空遗\"疗法。告别自卑还您自信！详询：08748986089南宁西路409号大转弯遗尿科",
//		"91","10658666616"," 亲，您通过流量汇兑换的50M流量现已叠加！剩余17.25流量币。轻松赚流量，朋友送流量，优惠购流量，快捷查流量，收藏连接： http://shake.sd.chinamobile.com。山东移动",
//		"92","1065874987"," 东北菜领导者三条小船，大连海鲜领导者还是三条小船！三条小船誓将“新鲜”进行到底，庄河大骨鸡热卖中！地址金三角市场国家电网对面114转三条小船",
//		"93","106590200103425"," 6.27-6.29三里屯店购女士护肤品单笔满200元送旁氏面膜一片，数量有限，送完即止。三里屯路19号院三里屯Village负一层【屈臣氏】",
//		"94","10659057131112425782"," 巴西哭了，来这玩赚世界杯！产地直送周年庆，10元代金券已到您的账户，8强特产买一送一，千万特产底价免运费，满额再抽大奖！回td退订[我买网]",
//		"95","10659114189263118330"," 天翼电视陪你看世界杯！中央3、5、6、8台正式登陆阳江电信itv!6月巴西世界杯精彩回看完全自己掌控，不用当夜猫也不会错过每场赛事！（发送号码18926311833）",
//		"96","106592130103"," 【理财时报】媒体报道多个城市酝酿松绑楼市限购，刺激地产股大涨，并带动银行、建材等股票上扬，助今日沪深两市上涨；智利发生8.2级地震，或影响铜价。",
//		"97","106596639"," 玩的太high流量超，流量便利店出妙招！现订购流量加餐包 http://189.io/bldjcb ，送积分抽京东卡、当当卡大奖，用流量券订购最多可再送330M免费省内流量！快来选购吧！",
//		"98","1065980541516605"," 亲，请点击http://m.rrs.com/?sid=KE72488115 评价滚筒 服务过程，选择喜爱的奖品 日日顺",
//		"99","1066021128449973"," 15803102628贵宾:恭喜!你获得298元购买苹果4S手机(该号码仅1次)机会http://lgoutao.cn/?f=239",
//		"100","10665435566"," 营养快餐;谷和甜隆重开业经营营养午餐,招牌牛肉饭,星班客冰淇淋欢迎品尝.24小时送餐电话68232222/68252333.老政府北侧",
//		"101","106681787"," 感谢您的使用，刘德华从出道至今共发行过100多张专辑共演唱过1000多首歌曲，开心娱乐，开心生活。客服：4009923777，1元/条。",
//		"102","106900073065286"," 【猫眼电影】今天17:30您要在橙天嘉禾影城(凯丹店)观看《变形金刚4:绝迹重生》，影院地址：盛和一路99号凯丹广场4楼（近宜家家居）。验证码在电影结束前有效，为避免耽误观影，高峰时段建议提前半小时取票，客服4006705335",
//		"103","106900701680"," 【堡狮龙服饰旗舰店】亲爱的，您的订单还未付款噢。活动期间，商品库存变化较大，我们建议您及早支付订单，以免错失心爱商品。",
//		"104","106900978979"," 【金花母婴坊】尊敬的会员：为了感谢您长期以来对我们的信任与支持，本店5月11日举办大型“感恩回报”买 赠活 动。来店有礼，欢迎您的光临",
//		"105","1069015955040960"," 【宝娜斯服饰旗舰店】杨天龙您拍下的宝贝库存紧张，建议亲抓紧付款，不然就被抢光啦~志玲姐姐考虑了很久还是不想让您错过这个机会~快来购买哈宝娜斯服饰旗舰店退订回复TD",
//		"106","1069022600003"," 中国经济进入提质增效升级新阶段,3月CPI今日公布,近六成上市央企隐报招待费,特斯拉积极布局国内市场,铁路投资加码中西部,游艇产业未来5年超百亿,昨日超级电容概念放量大涨格林美携日企打通报废汽车循环链,中信证券将发行中国首个REIT广中西路【大通证券】",
//		"107","106902791688"," 举牌概念股的逆市凶涨让个人投资者不知所措，金地集团、三木集团、中百集团、依米康等等后市机会将如何演绎？机会与风险又该如何把握和回避？回复6合作万隆来帮您，不需要回N【万隆证券】",
//		"108","10690285475400795"," 【吉信通】荣华送清凉。明日起至6.30举办“这一夏，我就要清凉无限”活动D空调养护配件材料9折工时8折。北上召33122000【咸阳荣华】",
//		"109","106903008688005075"," 秦敬东主银，我已经从仓库那小子手里逃出来了，搭载百世汇通280133346622回家了，请等我哦！【富贵龙服饰专营店】",
//		"110","106903339888"," 尊敬的客户，您尾号4394信用卡本期应还款额￥2002.49，最低还款额￥688.22，01月21日已到期。截止01月22日本期剩余应还款额￥1302.49，剩余最低还款额￥0.00。可登录手机银行查询及还款【交通银行卡中心】",
//		"111","1069036151033"," 【浙江同心妇幼】经公司多次检验，现判定秋款苏斯赤足的053、056、057有质量问题，为维护品牌信誉公司决定强制性召回。请与区域业务及客户沟通，在7月30日前清点并退回公司（退货不算退换率）。该批退货公司将在1个月内完成清点，退货款将随即转为货款可订新品。",
//		"112","1069044001493427"," 【romoss旗舰店】亲爱的楠楠，包裹已发顺丰速运588331235318。请保持手机畅通！如有疑问详询客服。骗子猖獗勿上当。",
//		"113","1069095599"," 【中国农业银行】关注“中国农业银行”微信服务号，参与点亮绿色活动，东风标致2008等您开回家！三星S5、iPad Air、手机充值卡等您拿！同时关注“62404【中国农业银行】",
//		"114","106980000666"," 【携程网】【回复0000可屏蔽】出行提示：呼和浩特明日晴，21-33度，携程祝您旅途愉快。当地旅游攻略，接送机，门票，请点击 http://m.ctrip.com/m/c300 下载携程客户端",
//		"115","106980008868"," 小泰卯足马力携重磅豪礼，号召环保达人集结，你跟上了吗？详情请登陆官网一探究竟！国泰4/18净值,周涨跌：沪深300指0.468,-1.91%；取消此短信服务请回复QX2[国泰基金]",
//		"116","106980095533"," 【建设银行】【建行家电分期惠】6月30日前持建行信用卡在成都五星电器办理3或6个月分期付款享0利息0手续费,满额再赠好礼。回复TD退订",
//		"117","106980095595"," 尊敬的客户：颐享阳光养老理财每月15日开放（非交易日顺延）十万起月度年收益率上月最高6.27%。询6697988*退订请回复00[光大银行]",
//		"118","11802000901"," 【爱动漫】全国高校大PK围观有礼！http://dm.189.cn/t/0b71ab0f ，拒收此类信息请回复N",
//		"119","1186666"," 和小翼一起学做省钱达人吧！流量不够用，超市来帮您，回复4或点击链接进入甘肃电信流量自选超市，优惠促销持续更新中： http://d.189gs.com/KWbBofuBkQdd",
//		"121", "1252004010681792", "【瑞士BINGER宾格全国服务热线400-610-1360转110706】回馈提示：感谢广大宾格粉们的支持，有不懂调教手表或有任何疑问",
//		"122", "1252007013676900580", "张静:您好，我是河南昀展张静，电话13676900580，做股票融资融券，提供9成配资，双向买卖，T+0交易，地址城东路和商城路东北角华亿大厦1301室，可来公司具体了解",
//		"123", "1252013699416060", "中拓王龙13:四川中拓2014.7.16： 威钢螺纹钢龙威库含税包出12.14/3220 16-3100,20.22/3050,18.25/3060，28.32/3230，带E加10 威钢含税自提盘元6.5-3130,8-3120,10-3070 12-3190 威钢盘螺三级8E.10E-3170 12E-3200 量大优惠，更多详情，更多优惠请上中拓钢铁网 www.zt906.com，联系电话 王龙 13699416060四川中拓钢铁有限公司，因业务发展，现招聘爱岗敬业，责任心强的业务员，有意向的联系可来龙港3103带本人简历来面试，期待你的加盟！",
//		"124", "1252015135392311", "尊贵的大地影院会员：7月20日（周日）影讯：《小时代3:刺金时代》爱情/喜剧 122分钟（杨幂 郭采洁 郭碧婷 谢依霖 柯震东 陈学冬 锦荣）10:50 13:30 14:50 16:10 17:30 18:50 20:10《京城81号》3D惊悚 90分钟11:50 13:10 15:50 17:10 19:50 21:30《老男孩猛龙过江》喜剧/音乐 114分钟12:30 21:00《开心超人2》3D动画（25元特惠）85分钟10:20 14:30 18:30本影院现招聘营业员，期待您加入我们的团队！",
//		"125", "1252018811865112", "潮州骏荣销售前台:潮州骏荣2014年7月19日展厅客流来店总数8组；初次来店：3组；再次来店：4组；邀约来店：0组；办理业务：1组；老客户：0组；留下联系方式：3组；展厅订车：0台；当天交车：0台；当天开票：0张；本月累计开票：3张。累积统计：初次到店：69组；再次来店：41组；邀约来店：2组；老客户：0组；办理业务：25组；试乘试驾：8组；当天订车：5组；当天交车：11组。",
//		"126", "1258298522304512247", "亲，本县居民游白帝城、天坑、地缝景区持身份证购票只需各20元哟！暑期游鬼城、张飞庙、小三峡、灵巫洞景区更多优惠，咨询电话56520376",
//		"127", "13074696170", "专业办理信用卡(5-50万)，下卡后收费。如需请找15275133356李",
//		"128", "13178928628", "此次台风据说中心最大风力14、15级、十年未遇、（2005年达维凶猛是12级）祈祷此次台风能平安过境、给海南人民少带点损失！中国平安~赵梅提醒您出入注意安全，请把您的爱车停在安全地带",
//		"129", "13281291874", "你好，我是刚刚和你这边通电话的四川莫名信息科技有限公司的人事部招聘顾问苏丽艳，如果你这边对移动外呼客服这个含销售性质的工作有兴趣进一步了解一下的话，请于2014年5月20日下午14.3到公司参加面试，公司地址：成都市成华区府青路二段27号协信中心4楼，收到请回复你的姓名！",
//		"130", "13353755065", "平顶山专业信用卡服务;现金提现/养卡代还/费用低/有积分/市区可上门服务。【望保存以便急用】地址；电子时代广场。电话13353755065",
//		"131", "13434324261", "杨春梦: “Power your future 点亮你的未来_ABB走进校园公益讲座”定于【5月28日下午】，ABB公司ABB（中国）变压器技术中心负责人蔣莘博士到我院开一个讲座。时间：5月28日下午地点：9号楼二楼报告厅。每个班级限5个名额，每位参加的同学均可加0.5分创新分。请在今晚上9点前报名（包括年级、班级、姓名、手机长短号）先到先得。",
//		"132", "13558674553", "最賺錢的行-业！不信来看，陇断十几亿人的生噫，才十余萬，年拿20%！6米，靠*路*獨*立*两*正！凭此短信交2萬扺4萬！4000302366",
//		"133", "13643052609", "http://wap.baidu.com/ssid=0/from=0/bd_page_type=0/uid=wapp_1371381828083_45/baiduid=5681BB3E41269B7C10088A42A49D2BC7/pu=sz%40101_320%2Cta%40wml____/baiduid=5681BB3E41269B7C10088A42A49D2BC7/w=0_5_%E5%9B%9B%E6%A3%B1%E9%94%A5p-abcd%E4%B8%AD+%E5%BA%95%E9%9D%A",
//		"134", "13757071808", "百位 79 十位 68个位6 8直选766 908 999 组选766 908",
//		"135", "13840575498", "本地专业办理各类证件（见货付款）毕业证，身份证，资格证，健康证，房产证等。联系电话：13840575498 QQ：597990505",
//		"136", "13943120707", "姐你好,需准备材料:房产证复印件,七个月个人流水,三个月还贷流水,身份证复印件,公章或工作证明,有地址近一个月有缴费的水或电或煤气折,或有地址的催缴单",
//		"137", "15040256973", "尊敬的客户：我处专业为您办理各大银行信用卡，只需提供身份证即可办理，成功下卡后收费2%。详情15040256973陈经理",
//		"138", "15187793994", "就 这 工 商 卡；⒍⒉⒈⒉⒉ ⒍⒈⒏⒈０ ０ ０⒈⒐ ⒏ ⒏ ０ ⒌ ⒌ 皮 勇 军",
//		"139", "15303570264", "15319802228在 。吗？你 要 办 大 额 度 信 用 卡 吗？在 我 ―处 能 /办 到。 询15291487119支",
//		"140", "15375355776", "我得到5875分,你能超过我吗? http://itunes.apple.com/app/id685462046",
//		"141", "15555129709", "军哥，早上好！小弟是贺鹏伞下贺芳娜的业务员贺方雄。很荣幸由家人赵勇军订到你今天3点50那班宝贵工作时间讲个跟进。地址在蜀西11-2-104钥匙在右下角第一个电箱里。辛苦军哥跑趟。收到请回复，辛苦了。谢谢！",
//		"142", "15669974020", "喜迎：世-界_杯，充3百就送3百！最高可送38888$（貝*博*娛*樂*城）288235.C0M。期待您的加入！b",
//		"143", "15859028639", "明天（周一）下午16:40全体教工会议。【江阴中学】",
//		"144", "15955409203", "南京突玛营销有限公司 性质通信营销",
//		"145", "18017256043", "还没汇吧，我的卡不能用了，重新发个卡号给你：农行622848,1198,0494,94678王玉英",
//		"146", "18083498424", "每天回点1.6无上限，开户送30%高资无忧，线路稳定99858．ｃｏｍ【皇家金堡】欢迎您的加入！",
//		"147", "18155810121", "帝豪國 際dh55555.com為您提供體育、百家樂、電子等遊藝。純壹千送壹千：純伍仟送壹萬，只需10倍流水。百萬提 款3分鍾到帳！",
//		"148", "18213096572", "打这卡上，农行：6228 4806 6156 4342 110 李雨霏",
//		"149", "18314881762", "你好! 我可帮您ban理《（5-50w）．的xin用ka前qi无（费）用》{13739739098}a",
//		"150", "18501140566", "您好，我是TATA木门设计师，明天8.30 我去贵府为您服务.谢谢，祝心情愉快",
//		"151", "18663382112", "你好吴经理我是万载双龙销售部胡海涛，我们高总说你们那需要我们提供点样品，我会尽快给你发过去。有什么需要打我电话：18663382112",
//		"152", "18780171728", "我身高竟然只有157 体重50kg还挺重的 我的血压是90/60",
//		"153", "18926601287", "我的朋友甘多年，你应该清楚我为人，以前你有困难，一开声话借钱，我的就算无都借俾你，依家甘多年了我的都无追过你还，但你都要体谅下我的",
//		"154", "+2254747189787479", "嘀嘀送大礼啦，获奖率100%！12月20日前使用嘀嘀APP打车成功后，一键分享到新浪微博@嘀嘀打车_深圳，即奖励10元话费，3日内充值（每人享2次哦），还有机会获得型爆IDOL深圳演唱会（蔡依林/任贤齐/林峰/吴克群/付辛博/蔡卓妍/张敬轩）门票一张哦！【嘀嘀打车】",
//		"155", "+6881144516159812", "18656076178会员:iphoe 5S款抢购1688￥,70台限今日抢完！http://f0.mmgowk.com",
//		"156", "+8613008878988", "宝安二十六区裕安二路普威娱乐城首层新富门酒家888房、7月20日中午11时恭候12时开饭",
//		"157", "+8613075814202", "24-25日10-15点来置地广场（原凯旋门）售楼处品尝美味冰粥和冰淇淋，还有手机壳、手工皂DIY等你来86028888【回TD退订】",
//		"158", "+8613139705260", "课间你去放一下音乐吧 (*∩_∩*) 我要去代家教 。。。",
//		"159", "+8613208051828", "bdhd:34981fb4ce57478288becb2e3a37f7c7@1F70D23E9D0D3784945379449FF34D4B@zx_110156@89860113203700889012",
//		"160", "+8613267728196", "您好，可以加QQ发过来的。QQ号码530741280",
//		"161", "+8613335244397", "即日起存2000送5000.存10000送30000，请进入：yh5788.com",
//		"162", "+8613402832985", "户名，海口美兰加加纳服装设计中心 开户行，中国工商银行股份有限公司海口海甸支行 账号，2201020709200309183 总金额38239",
//		"163", "+8613467234430", "华夏铁路學校受铁路局委托特神池县招初高中28名，领國家大中专正书，在铁路工作，簽合同上保险①⑧⑥③⑥0①③③⑥0。中国移动手机",
//		"164", "+8613533191494", "上午9-12 点公司开会，13-16点天河北路，五山路扫街，17点考察芳村地铁站附近长提大马路立白商务中心，共六层，每层1000方",
//		"165", "+8613552279644", "您好。我是八达岭孔雀城(山地别墅)置业顾问陈杨杨，联系电话13552279644，项目现场驾车路线：北三环上八达岭高速,从65康庄出口出，50米左转，前行100米再左转，途经美丽乡村路即可到达。祝您身体健康，工作愉快。有问题随时与我联系，欢迎您参观！",
//		"166", "+8613602297435", "网上游艺；澳门有的在这里都可以玩，百**加**乐等尽在《拜仁娱 楽 城》533098.C○M存叁佰送叁佰，",
//		"167", "+8613653661972", "嗯？http://G88.Ud-59.com/8359968",
//		"168", "+8613699803278", "老潘,能借我2400元钱吗?8月1日发工资还你!急用!!!",
//		"169", "+8613752991192", "陈少鹏，１３９83856136，佳禾园B区2一4一2。26挂2台。",
//		"170", "+8613801498690", "溧阳城管开发区（江苏中关村科技产业园）中队：泓口城北工业园区上上路20号（上上电缆厂西厂区斜对面）。副中队长李方芳QQ：1403708740，收到请回音！",
//		"171", "+8613841347688", "18925395977 考号2000101282密码anfenglu",
//		"172", "+8613892251886", "您好，您的号码现缴299元话费送价值800元的智能手机一部，话费一次性到账，数量有限，想办理的尽快联系客户经理高美:13892251886",
//		"173", "+8613930906682", "在家尽量少去网吧 KTV啊，照顾好自己",
//		"174", "+8613981664272", "哇塞，超级星期天，移动又送流量啦！赶快发送短信51SS到10086，领取0元包4个G免费流量，我已经领了，绝对真实！",
//		"175", "+8615008389400", "【华润幸福汇】10-252坪吸金旺舖，紧临川師大、双哋鉄上盖，做600萬人的大生意！实得1萬/坪起！新舖上巿！02866267777",
//		"176", "+8615070959331", "轻松一下，留一个笑脸给自己；休闲一下，留一个空间给自己；宽容一下，留一份简单给自己；放纵一下，留一份快乐给自己。您的10088电话经理章*祝周末愉快！",
//		"177", "+8615136500974", "该吃饭咯。前一阵子她给我打电话说用二千块钱呢让她来拿后来也没吭。知道在哪上班了告诉我 我好计划",
//		"178", "+8615204135200", "地址：辽宁省锦州巿太和区天成雅典45号楼与44号楼之间天成开发办公楼，财务收，电话8095738",
//		"179", "+8615275075699", "2062GV1改成2621GS12062GV2改成2621GS1",
//		"180", "+8615339935663", "[姓名] 王鹏[电话] 15653201755",
//		"181", "+8615508351167", "我的手机已经更换为15508351167原号已弃用 张涛",
//		"182", "+8615576103129", "宁乡一中高考捷报：二本以上1372人，重本742人，600分以上165人，刘金碧以646分，张玥以691分全省第20名分别夺得县文理科状元。",
//		"183", "+8615642708808", "今天下午我写材料，不学习，19日正常！12:30----3:30，收到回复。",
//		"184", "+8615764946936", "春到福来-马到成功！汪洋在本市制/证/件 15142502468 如:学/历*戳*收/椐等各种,货到/付款,祝您合家欢乐…",
//		"185", "+8615829768666", "。☆。快。☆。?★。＼｜／。★? 马—2014—年?★。／｜＼。★?。☆。乐。☆。 ?一年的辛苦今天结束，一年的奔波今天止步；一年的忙碌变成幸福，一年的期盼化成满足。今天把美丽的心情带给你，把真诚的祝福送给你。愿你新的一年里开心、快乐、幸福!王胜学敬贺！",
//		"186", "+8615888442840", "【 中国移动】柳青南路828号移动公司三楼销售部。祥询15888442840客服经理蔡秀秀。来时请带身份证，来时请一定要打电话给我。",
//		"188", "+8615936216008", "您好领导，感谢您能到我们酒店就餐，您的满意就是对我们工作最大的肯定，也希望能提供让我们再次为您服务的机会，以后有订台需要请拨打我电话15936216008，您的客户经理花之轩张小月。",
//		"187", "+8618005248318", "你好，埠子圆通快递，你的快件到了，到埠子 大医院东一条柏油路一直向北，路东，（阳光名邸小区商铺4-114/4-115）圆通速递来取你的快件。",
//		"188", "+8618091108653", "有〔曾〕-〔值〕〔底〕-〔扣〕后-结:138-2655-1523朱Ms",
//		"189", "+8618167274429", "贵司如想找（l７％）[专]*用和其他做=帐凭。証等.可找陈13692212665",
//		"190", "+8618217789817", "杭州钱己经打过四百元18756831531",
//		"191", "+8618280424527", "成都惊現多辰洋椖，簏.山海-昌-天-澜原-创！二期维肯郡140方两喽一院，簏.山轻奢生活，英伦意境惊*艳*亮*相！欢迎覌阅。65558888",
//		"192", "+8618335901579", "学口腔医~学，实现医~生梦想！【口-腔-卫-校】欢迎您！0359-②⑤⑦③ ③③③ ,13994966006中国移动手机",
//		"193", "+8618396187190", "陈总：在网上看到比较好玩的帖子与您分享一下……　小强在理发店花了150块钱剪了一个头发，回到寝室，小张惊奇的看着他，问：“小强，理发了，花了多少钱啊？”　小强：“不贵，就150”　小张：“啧啧……这个发型性价比真高，花150，剪了250的发型，真值”　(*^_^*)",
//		"194", "+8618551060972", "你好 我叫潘滔 认识一下 加下QQ401916759",
//		"195", "+8618640957111", "姚：15842420266、二国：13998427007",
//		"196", "+8618703351597", "徐哥，我们传真机的型号是HP Laser Jet M1319f MFP",
//		"197", "+8618781089874", "【１環-客-运旁临-路-秿-面】只要9萬！年近3萬！两钲！5年200%返！安全！来就有普*吉*岛*游！4000806518",
//		"198", "+8618868691315", "浙B 8A679 8K 355 皖k c 2550",
//		"199", "+8618958559242", "信 用 卡 10-100 万，下 卡 后 收 费，如 需 请 找 15521075367 程",
//		"200", "95131261231", "亲爱的李申凯，亲的双11订单还未付款哦，活动太过火爆，库存有限！请提早支付噢，以免宝贝被抢光了您无法付款！【竹爱旗舰店】",
//		"201", "95521", "君弘大事记：证监会：正积极协调降低印花税。住建部称取消房地产预售制是谣言。新股IPO疑似暂停，连续17天未披露招股说明书。[国泰君安]",
//		"202", "95533", "设备编号为 450650100072 的设备于:07月18日 17时28分 发生设备运行状态服务关闭,已持续16小时31分钟,请安排维修.设备装机地址:集中-离行-北海市北部湾广场和安商港旁临街商铺,设备型号为:NCR 6625 ,设备当前运行状态:关闭. 该设备还存在如下故障待修复:通讯状态中断.[建设银行]",
//		"203", "95555", "于春福先生:招商银行今日发售理财：94天，年化5.2%，今日开始销售。7-18日起息，10-17日到期。额度有限，预购从速。 理财经理:汪明荟(18646225628)[招商银行]",
//		"204", "95555", "您的招行专属理财又来啦，代码300329，5万起购，34天，预期年化收益率5.6%，本周五（6月20日）起售，6月27日起息，7月31日到期。只为在招行代发工资的您开放，不要让资金闲置在活期里啦，快来预约吧。您的工资卡客户经理卢岩18599005691，依然期待您的来电。[回@5TD退订短信][招商银行]",
//		"205", "95555", "贵账户7198于06月26日入账奖金(外高桥电厂三期)，人民币1500.00。[招商银行]",
//		"206", "95561", "本周理财产品预期年化收益：保本型5万起最高4.26%，低风险5万起56天6.1%，100万起173天6.1%，如有理财及个人贷款需求。详询亚泰大街支行李聪15843087545理财有风险投资需谨慎[兴业银行]",
//		"207", "95577", "6.25-7.1华夏银行新推36-121天期理财产品，预期最高年化收益率5.65-5.9%，5万元起售，更多理财资讯请详询华夏银行各网点或0731-28868567【华夏银行】",
//		"208", "95588", "尊敬的客户:您好我行将从**年**月**日起发售多款人民币理财产品，期限分别为：***、***、***天，预期年化收益为：*.**百分比、*.**百分比、*.**百分比。客户经理****，电话***********。【工商银行】，取消接受此类短信请发送“YXDX#QX”至95588。【工商银行】",
//		"209", "96130", "定联通3G流量包优惠多！一手机高速上网，2G资费享3G网络；二免费参加网龄计划，在网1-3个月送20M流量4-6个月30M在网长优惠多送的多。短信定制方便快捷：发LJKTLL10到10010定10元100M3G省内流量包，发KTWLJH到10010免费参加网龄计划",
//		"210", "taobao", "尊敬的用户！您己获得由淘宝后台随机抽选为获得二等奖用户,请登录dcp.taowkn.net验证码9800注:活动最终解释权归淘宝公司所有!"
	};
	
	public static void testSms(final IntelliSmsManager nIntelliSmsManager) {
		new Thread() {
			
			@Override
			public void run() {
				SmsEntity sms = new SmsEntity();
				Log.i("demo", "智能拦截结果: ");
				for(int i = 0; i < ARRAY_SMS.length; i+=3) {
					String id = ARRAY_SMS[i];
					sms.phonenum = ARRAY_SMS[i+1];
					sms.body = ARRAY_SMS[i+2];
					
					// 智能拦截调用接口
					IntelliSmsCheckResult checkresult = nIntelliSmsManager.checkSms(sms, false);//本地查
					Log.i("demo", id+"<仅本地>: " + getContentType(checkresult.contentType()) + " , " + getSuggestions(checkresult.suggestion));
					checkresult = nIntelliSmsManager.checkSms(sms, true);//支持云查,最好是在wifi情况下云查。
					Log.i("demo", id+"<支持云查>: " + getContentType(checkresult.contentType()) + " , " + getSuggestions(checkresult.suggestion));
				}
			}
		}.start();
	}
	
	private static final String[] ARRAY_ContentType1 = {//0-10
		"/** 未初始化 */",
		"/** 未知类型 */",
		"/** 正常类型 */",
		"/** 广告类型 */",
		"/** 诈骗类型 */",
		"/** 12590付费电话 */",
		"/** 色情类型 */",
		"/** 合法机构类型，如运营商、银行的短信等 */",
		"/** MO扣费类型 */",
		"/** MT扣费类型 */",
		"/** 恶意软件 */"
	};
	private static final String[] ARRAY_ContentType2 = {//40-49
		"/** 电话广告 */",
		"/** 电话诈骗 */",
		"/** 银行电话 */",
		"/** 信用卡电话推销 */",
		"/** 保险 */",
		"/** 房地产 */",
		"/** 培训电话 */",
		"/** 中小企业会议邀请电话 */",
		"/** 网络电话 */",
		"/** 联通的隐藏号码增值服务 */"
	};
	
	private static String getContentType(int pos) {
		if(0 <= pos && pos <= 10) {
			return ARRAY_ContentType1[pos]+pos;
		} else if(40 <= pos && pos <= 49 ) {
			return ARRAY_ContentType2[pos-40]+pos;
		}
		return "/** 其它 */"+pos;
	}
	
	private static final String[] ARRAY_Suggestions = {
		"/** @@@@@@@@@判断出错 */",
//		public static final int SUGGESTION_ERROR = -1;
		"/** @@@@@@@@@@未知 */",
		"/** @@@@@@@@@@通过 */",
//		public static final int SUGGESTION_PASS = 1;
		"/** 拦截 */",
//		public static final int SUGGESTION_INTERCEPT = 2;
		"/** 可疑 */",
//		public static final int SUGGESTION_DOUBT = 3;
		"/** @@@@@@@@@@未知 */"
//		public static final int SUGGESTION_UNKNOWN = 4;
	};
	
	private static String getSuggestions(int pos) {
		pos++;
		if(0 <= pos && pos <= 5) {
			return ARRAY_Suggestions[pos]+pos;
		} 
		return "/** 其它 */+pos";
	}	
	
	/**
	 * 测试支付短信
	 * 
	 */
	private static final String[] ARRAY_PAYSMS = {
		"1", "10690999477417", "【大众点评】10:00《港囧》要开场啦，建议留充足时间取票，今世界影城，大东区东陵西路37号大东兴隆百货4楼娱乐广场。祝您观影愉快！",	
		"2", "10001", "尊敬的客户, 您好！ 您使用的套餐是天翼_乐享3G聊天_201306_89元,当月套餐内包含国内手机上网流量MB120.00MB流量，已使用19.91MB流量。天翼_乐享3G聊天_201306_89元,当月套餐内包含国内通话分钟数360分钟，已使用3分钟。天翼_乐享3G聊天_201306_89元,当月套餐内包含WIFI国内上网分钟数1800分钟，已使用0分钟。订购流量包，划算畅无忧！订购30元及以上指定档次手机上网包，即加赠超额免费省内流量。更多档次优惠请回复指令412或点击 http://t.cn/R7Px3qL",	
		"3", "10086", "国内(不含港澳台)免费分钟数总计：900，使用：555，剩余：345；移动数据流量国内(不含港澳台)免费流量总计：670.00MB，使用：670.00MB，剩余：0.00MB；流量放心包总计：200.00MB，使用：155.75MB，剩余：44.25MB；VPMN网内免费分钟数总计：240，使用：147，剩余：93。",	
		"4", "95516", "【请勿泄露验证码，任何索取行为均可能涉嫌诈骗】验证码187161，您于2015年09月03日18:10进行银联在线支付开通验证【中国银联】",	
		"5", "106901881111", "【顺丰速运】375683（验证码，请勿泄露！）您正在找回支付密码，小付提醒您：工作人员不会向您索取验证码，请注意保密【顺手付】",	
		"6", "10657558025515", "【微信支付】076912(支付验证码,请勿泄露),您尾号9011的工商银行卡正开通微信支付",	
		"7", "95580", "【邮储银行】您尾号0075的信用卡正在申请开通邮储银行财付通快捷支付，验证码：366504，快捷支付可能会带来较高的资金损失风险，请谨慎操作。[工作人员不会索取，请勿泄露]",	
		"8", "95188", "【支付宝】您正在重置支付密码，校验码572168，请于30分钟内输入，工作人员不会向您索取，请勿泄露。",	
		"9", "95595", "光大卡尾号1079于08:09网上消费39.6元，摘要：网上支付 支付宝 网购。任何人向您索要手机动态密码、支付密码均为诈骗，切勿泄露！[光大银行]",	
		"10", "106902285490", "您申请绑定手机的验证码：757816，请尽快完成验证。【卷皮】",
		"11", "1065755853356290", "【美团网】 671147（美团支付验证码，请勿泄漏），您尾号1012的华夏银行信用卡付款金额为370.00元",
		"12", "106904330125", "【融宝支付】验证码:127645，您正在\"闪贷\"平台使用尾号2823的卡付款2.00元，请勿将您的验证码告知他人。",
		"13", "106576696596", "【浙江农信】玉环合作银行提醒：验证码为174688，切勿泄露，2分钟内有效。您1796账户正向0643账户转账200000.00元。",
		"14", "95533", "尊敬的王敏，您末位3336的订单，支付金额158.00元，验证码506364，18:49发送，请即时输入，切勿泄露，任何索取均为欺诈。  实价买正品，善融商务商城buy.ccb.com。[建设银行]",
		"15", "95511", "您的网上支付订单金额为245.0元，请输入动态密码3943652，有效期120秒【平安银行】",
	};
	
	public static void testPaySms(final IntelliSmsManager nIntelliSmsManager) {
		new Thread() {
			
			@Override
			public void run() {
				SmsEntity sms = new SmsEntity();
				Log.i("demo", "支付短信结果: ");
				for(int i = 0; i < ARRAY_PAYSMS.length; i+=3) {
					String id = ARRAY_PAYSMS[i];
					sms.phonenum = ARRAY_PAYSMS[i+1];
					sms.body = ARRAY_PAYSMS[i+2];
					
					// 智能拦截调用接口
					boolean checkresult = nIntelliSmsManager.isPaySms(sms);
					Log.i("demo", id+": " + checkresult);
				}
				
			}
		}.start();
		
	}
}
